Repository: demidov91/select-by
Catalog: locale/*/LC_MESSAGES/django.po
Languages: be, ru

source: identifier
be: ідэнтыфікатар
ru: идентификатор

source: name
be: імя
ru: имя

source: address
be: адрас
ru: адрес

source: is removed
be: выдалены
ru: удалён

source: usd
be: долар
ru: доллар

source: eur
be: еўра
ru: евро

source: rub
be: расійскі рубель
ru: рубль

source: currency
be: валюта
ru: валюта

source: buy
be: пакупка
ru: покупка

source: rate
be: курс
ru: курс

source: sell
be: продаж
ru: продажа

source: registration IP address
be: IP рэгістрацыі
ru: IP адрес регистрации

source: last changed
be: апошняе рэдагаванне
ru: последнее редактирование

source: Anon
be: Анон
ru: Анон

source: Hi
be: Вітаю цябе
ru: Привет

source: It's not me! My name is
be: Гэта не я! Меня завуць
ru: Это не я! Меня зовут

source: show me my rates!
be: пакажы мне мае курсы!
ru: покажи мои курсы!

source: Very likely you will prefer to use awesome <a href="http://mobile.tut.by/app-finance.html" target="_blank">tut.by application</a> or use original <a href="http://select.by/kurs/" target="_blank">select.by</a> site.
be: Адразу спойлер: хутчэй за ўсё, такбе спадабаецца мабільны дадатак ад <a href="http://mobile.tut.by/app-finance.html" target="_blank">tut.by</a> - там мапа, свежыя курсы, усё такое. Але ёсць у яе адзін недахоп: калі некалькі абменнікаў стаяць побач, то іх курсы "напаўзаюць" адзін на аднаго, і карыснасць прылады зніжаецца да нуля.
ru: Сразу спойлер: скорее всего, тебе понравится прилага от <a href="http://mobile.tut.by/app-finance.html" target="_blank">tut.by</a> - там карта, свежие курсы, все дела. Но есть у неё один недостаток: если обменники стоят рядом, то их курсы "наползают" друг на друга и полезность приложения резко опускается до нуля.

source: If you still want to try this filter, select exchange offices you would like to follow and type any unique name.
be: Зараз аб тым, навошта гэта зроблена.<br>Калі валюту трэба набыць/прадаць, трэба доўга чакаць, калі загрузіцца і адсарціруецца велізарная табліца на <a href="http://select.by/kurs/" target="_blank">select.by</a>. І вось атрымаў ты гэту табліцу і бачыш: лепшы курс - на Кунцаўшчыне. Ну, шыкоўна, думаеш, я-та на Уруччы. Крыху лепшы курс у Малінаўке. Не тое. Вось, банк, які побач выставіў добры курс. А, не, гэта толькі у некалькіх аддзяленнях добры курс, у тваім - не такі прывабны. Карацей, пакуль ты лазіш, браўзэр падае, з'еўшы ўсю апераціўку на тэлефоне, дадзеных у табліцы нямала (не будзем удакладняць, у якім годзе характарыстыкі майго тэлефона былі топавымі).
ru: Теперь о том, зачем это сделано.<br>Когда валюту надо купить/продать, надо долго ждать, когда загрузится и отсортируется огромная таблица с курсами на <a href="http://select.by/kurs/" target="_blank">select.by</a>. И вот получаешь эту огромную таблицу, и там видишь: лучший курс - в Кунцевщине. Ну, офигеть, думаешь, я-то на Уручье. Чуть хуже курс в Малиновке. Не то. Вот, банк, который рядом выставил хороший курс. А, нет, это только в нескольких отделениях хороший курс, в твоём - не такой привлекательный. Короче, пока так лазишь, браузер падает, съев всю оперативку на телефоне, данные там не маленькие на странице (не будем уточнять, в каком году характеристики моего телефона были топовыми).

source: Rates are updated each 15 minute: not too rare for you, not too often for me and select.by
be: Так што, тут вы па адрасу выбіраеце свае бліжэйшыя аддзялення банка, уводзіце якое-небудзь імя карыстальніка, можна кірылічнае, і вам паказваецца скарочаная версія дадзеных з select.by. Абнаўленне з select.by - кожныя 15 хвілін: і вам павінна хапіць, і мяне не павінны забаніць.
ru: В общем, здесь вы по адресу выбираете свои ближайшие отделения банка, вводите какое-нибудь имя пользователя, можно кирилическое, и просматриваете сокращённую версию последних данных с select.by. Обновление с select.by - каждые 15 минут: и вам должно хватить, и меня не должны забанить.

source: Your choice will be stored in cookies and can be restored by username
be: Пасля таго як аднойчы стварылі набор абменнікаў, можна адчыніць свой набор на іншай прыладзе, іншым браўзеры, калі ўведзяце імя карыстальніка у правым верхнім куту экрана. А як жа пароль? Я ён вам патрэбны? Пакуль што спадзяюся на вашу сумленнасць, але планую дапісаць бан за падбор імені карыстальніка.
ru: После того как однажды создали набор обменников можно открыть свой набор на другом устройстве, другом браузере, введя имя пользователя в верхнем правом углу на этой странице. А как же пароль? А он вам нужен? Пока что полагаюсь на вашу сознательность, но скоро для полноты картины допишу бан за подбор имён пользователей.

source: Have a nice rate!
be: Прыемнага карыстання!
ru: Приятного использования!

source: Name
be: Імя
ru: Имя

source: Save
be: Захаваць
ru: Сохранить

source: Without changes
be: Не змяняць

source: Oooh! How much offices there is here! Filter them!
be: Колькі тут абменнікаў развялось! А дзе маі? (па-расейску, на жаль)
ru: Ничоси, сколько обменников. Отфильтруй-ка их!

source: This page exists thanks to <a href="http://select.by/" target="_blank">select.by</a> data!
be: Гэта старонка існуе дзякуючы <a href="http://select.by/" target="_blank">select.by</a>
ru: Это страница существует благодаря данным с сайта <a href="http://select.by/" target="_blank">select.by</a>!

source: settings
be: налады
ru: настройки

source: Exchange office
be: Абменнікі
ru: Обменный пункт

source: Last NBRB rates
be: Апошнія курсы НБРБ
ru: Последние курсы НБРБ

source: Current RUB rate
be: Бягучы курс расійскага рубля
ru: Текущий курс российского рубля

source: <span> I expect </span><input id="next-nbrb" value="" /><span> for dollar on the end of the trades</span>
be: <span>Разлічваю на </span><input id="next-nbrb" value="" /><span> за даляр пры закрыцці</span>
ru: <span> Ожидаю </span><input id="next-nbrb" value="" /><span> за доллар на закрытии торгов </span>

source: Condition for in-day buy-sell operation
be: Крытычная ўзроўні
ru: Критические значения

source: You can sell at
be: Адназначна прадаваць пры
ru: Однозначно продавай при

source: You can buy at
be: Адназначна купляць пры
ru: Однозначно покупай при

source: Plan your deposit in
be: Планаванне дэпазіту ў

source: for
be: на
ru: на

# plan-deposit
source: months
be: месяцаў
ru: месяцев

source: When exchange rate is stable deposits with lower percents are not effective and can even lead to money loss nominated in national currency. Here you can type your most optimistic and pessimistic rate expectations, specify period in months and this tool will advice you what share of savings can prevent money loss. Remember that middle-term and long-term savings need different management.
be: Калі абменны курс устойлівы, дэпазіты з ніжэйшымі стаўкамі намінаваныя у інвалюце становяцца не эфектыўнымі і могуць нават прывесці да страт у пераліке на нацыянальную валюту. Тут вы можаце ўвесці свае самыя аптымістычныя і песімістычная чаканні валютнагы курсу на канец актуальнага для вас перыяду і ўбачыць, якое размеркаванне укладаў перадухіліць страты ў тым ці іншым вападку. Памятайце, што доўгачасовыя і сярэднечасовыя зберажэнні патрабуюць рознага кіравання.
ru: Когда обменный курс стабилен, депозиты с более низкими ставками номинированные в иностранной валюте становятся не эффективны и могут даже привести к потерям номинированным в национальной валюте. Здесь вы можете ввести свои оптимистичные и пессимистичные ожидания изменения курса на конец интересующего вас периода и увидеть, какое распределение вкладов предотвратит потери в том или ином случае. Помните, что долгосрочные и среднесрочные сбережения требуют разного управления.

source: National currency
be: Рублі
ru: Рубли

source: Double capitalization
be: Двайная капіталізацыя
ru: Двойная капитализация

source: Foreign currency
be: Валюта
ru: Валюта

source: Take conversation loss into account
be: Улічываць страты на канвертацыю
ru: Учитывать потери на конвертацию

source: Exchange rates expectations
be: Чаканні абменннага курсу
ru: Ожидания валютного курса

source: Maximal
be: Максімальны

source: Minimal
be: Мнімальны
ru: Минимальный

source: Currencies proportion
be: Размеркаванне па валютах
ru: Распределение по валютам

source: Loss of
be: Страты
ru: Потеря

source: can't be prevented with such rates expectations.
be: не могуць быць перадухіліны з уведзенымі чаканнямі курсу.
ru: не может быть предотвращена при введённых параметрах.

source: Foreign
be: Валюта
ru: Валюта

source: Fix coefficients
be: Паправачныя каэфіцыенты
ru: Поправочные коэфициенты

source: Exchange office margin
be: Маржа абменнікаў
ru: Маржа обменников
