from django.utils.translation import ugettext_lazy as _

BANK_NAME_TO_SHORT_NAME = {
    "Банк Решение": "R",
    "Идея Банк": "I",
    "РРБ-Банк": "РРБ",
    "БТА Банк": "БТА",
    "Альфа-Банк": "А",
    "ФрансаБанк": "Ф",
    "БСБ Банк (БелСвиссБанк)": "BSB",
    "пл. Свободы, 23": "BSB",
    "БелГазпромБанк": "Г",
    "Банк БелВЭБ": "ВЭБ",
    "БелИнвестБанк": "bInv",
    "МТБанк": "МТБ",
    "ПриорБанк": "Pr",
    "Паритетбанк": "Par",
    "Белорусский Народный Банк": "БНБ",
    "ВТБ Беларусь": "ВТБ",
    "ТехноБанк": "Т",
    "БелАгроПромБанк": "БАПБ",
    "БеларусБанк": "ББ",
    "Москва-Минск Банк": "ММБ",
    "ТК Банк": "ТК",
    "Цептер Банк": "Ц",
    "Абсолютбанк": "Абс",
    "БПС-Сбербанк": "БПС",
    "ЕвроТоргИнвестБанк": "Евр",    
}

IDEABANK_ONLINE_OFFICE = '1101'

ONLINE_EXCHANGE_OFFICES_NAMES = {
    IDEABANK_ONLINE_OFFICE: _('IdeaBank24'),
}

ONLINE_EXCHANGE_OFFICES_IDENTIFIERS = ONLINE_EXCHANGE_OFFICES_NAMES.keys()
