from django.utils.translation import ugettext_lazy as _

BANK_NAME_TO_SHORT_NAME = {
    "Банк Решение": "Решение",
    "Идея Банк": "Idea",
    "РРБ-Банк": "РРБ",
    "БТА Банк": "БТА",
    "Альфа-Банк": "АльфаБанк",
    "ФрансаБанк": "ФрансаБанк",
    "БСБ Банк (БелСвиссБанк)": "BSB",
    "пл. Свободы, 23": "BSB",
    "БелГазпромБанк": "БелГазпромБанк",
    "Банк БелВЭБ": "БелВЭБ",
    "БелИнвестБанк": "Белинвест",
    "МТБанк": "МТБ",
    "ПриорБанк": "Приорбанк",
    "Паритетбанк": "Паритетбанк",
    "Белорусский Народный Банк": "БНБ",
    "ВТБ Беларусь": "ВТБ",
    "ТехноБанк": "ТехноБанк",
    "БелАгроПромБанк": "БАПБ",
    "БеларусБанк": "Беларусбанк",
    "Москва-Минск Банк": "Москва-Минск",
    "ТК Банк": "ТК",
    "Цептер Банк": "Цептер",
    "Абсолютбанк": "Абсолют",
    "БПС-Сбербанк": "БПС-Сбербанк",
    "ЕвроТоргИнвестБанк": "ЕвроторгИнвест",    
}

IDEABANK_ONLINE_OFFICE = '1101'

ONLINE_EXCHANGE_OFFICES_NAMES = {
    IDEABANK_ONLINE_OFFICE: _('IdeaBank24'),
}

ONLINE_EXCHANGE_OFFICES_IDENTIFIERS = ONLINE_EXCHANGE_OFFICES_NAMES.keys()

DEFAULT_TIMEOUT = 30
